Autodesk.Revit.DB.Plumbing.PipingSystem.CanBeHydraulicLoopBoundary(Autodesk.Revit.DB.Element)
Checks if the element can be used as a hydraulic loop boundary.
element:
The element to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Plumbing.PipingSystem.IsHydraulicLoopBoundary(Autodesk.Revit.DB.Element)
Checks if the element is a valid hydraulic loop boundary.
element:
The element to be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Plumbing.PipingSystem.DeleteHydraulicSeparation(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Deletes hydraulically separated systems and merges the system components into the connected system.
document:
The document where the system is deleted.
pipeElementIds:
The boundary pipe that separates the system. Multiple pipes are allowed to delete more than one separated systems.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements is not a pipe.
-or-
One or more elements is not a valid loop boundary.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Plumbing.PipingSystem.CreateHydraulicSeparation(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Creates new system which is hydraulically separated from the existing system.
Remarks:
Hydraulically separated systems allow independent flow and pressure analysis for each hydraulic loop.
For example, each hydraulic loop has its own cirtical path. The calculated pressure drop on the primary
pump is consisted of all pressure drop on the primary critical path. Any pressure drop on the secondary
loop would only contribute to the calculated pressure drop of the secondary pump.
document:
The document where the new system is created.
pipeElementIds:
The boundary pipe that defines a new system. Multiple pipes are allowed to create more than one separated systems.
Returns:
The newly created piping system elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements is not a pipe.
-or-
One or more elements is already the loop boundary.
-or-
One or more elements can not be used as loop boundary. Check if the element connects to any junction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Plumbing.PipingSystem.GetPumpSets
Gets the set of element Id's for all pump sets in the system, if any.
Returns:
The set of all the pump sets in the system.
Since:
2019

Autodesk.Revit.DB.Plumbing.PipingSystem.GetFixtureUnits
Gets the fixture units of this piping system.
Remarks:
The system fixture units is calculated in the non-blocking evaluation framework. The caller may set up callbacks that react to the asynchronous calculation results.
If no callback is set up (e.g, called from third-party applications), the calculation is automatically switched to synchronous calculation so the caller
can access the up-to-date result. Similarly, the public method get_ParameterValue(BuiltInParameter.RBS_PIPE_SYSTEM_FIXTURE_UNIT_PARAM) has the same behavior.
Due to this change, the parameter RBS_PIPE_SYSTEM_FIXTURE_UNIT_PARAM no longer supports dynamic model update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fixture units can not be calculated for this system.
Since:
2017

Autodesk.Revit.DB.Plumbing.PipingSystem.GetStaticPressure
Gets the static pressure of this piping system.
Remarks:
The system static pressure is calculated in the non-blocking evaluation framework. The caller may set up callbacks that react to the asynchronous calculation results.
If no callback is set up (e.g, called from third-party applications), the calculation is automatically switched to synchronous calculation so the caller
can access the up-to-date result. Similarly, the public method get_ParameterValue(BuiltInParameter.RBS_PIPE_STATIC_PRESSURE) has the same behavior. Due to this
change, the parameter RBS_PIPE_STATIC_PRESSURE no longer supports dynamic model update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The static pressure can not be calculated for this system.
Since:
2017

Autodesk.Revit.DB.Plumbing.PipingSystem.GetFlow
Gets the flow of this piping system.
Remarks:
The system flow is calculated in the non-blocking evaluation framework. The caller may set up callbacks that react to the asynchronous calculation results.
If no callback is set up (e.g, called from third-party applications), the calculation is automatically switched to synchronous calculation so the caller
can access the up-to-date result. Similarly, the public method get_ParameterValue(BuiltInParameter.RBS_PIPE_FLOW_PARAM) has the same behavior. Due to this
change, the parameter RBS_PIPE_FLOW_PARAM no longer supports dynamic model update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The flow can not be calculated for this system.
Since:
2017

Autodesk.Revit.DB.Plumbing.PipingSystem.GetVolume
Gets the volume of this piping system.
Remarks:
The publicly exposed method.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The volume can not be calculated for this system.
Since:
2017

Autodesk.Revit.DB.Plumbing.PipingSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Creates a new instance of a piping system and adds it to the document.
ADocument:
The document where the element will be created and added.
typeId:
The identifier of this piping system element's type.
name:
The name of the piping system to be created.
Returns:
The newly created piping system element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The typeId is not an element id for a valid piping system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011

Autodesk.Revit.DB.Plumbing.PipingSystem.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a new instance of a piping system and adds it to the document.
ADocument:
The document where the element will be created and added.
typeId:
The identifier of this piping system element's type.
Returns:
The newly created piping system element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The typeId is not an element id for a valid piping system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2011

Autodesk.Revit.DB.Plumbing.PipingSystem.IsPressureDropServerMissing
Indicates if any pressure drop server which was used in the piping system is not available.
Returns:
True if there is any pressure drop server not available, false otherwise.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipingSystem.IsFlowServerMissing
Indicates if any flow server which was used in the piping system is not available.
Returns:
True if there is any flow server not available, false otherwise.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipingSystem.IsWellConnected
Indicates if the system is well connected or not.
Remarks:
If the system is not well connected, parameters which need to be calculated are invalid.
Since:
2011

Autodesk.Revit.DB.Plumbing.PipingSystem.PipingNetwork
Pipes and fittings which are contained in this system.
Remarks:
The return value doesn't include mechanical equipment elements.
The pipes and fittings are not returned in any particular order.

Autodesk.Revit.DB.Plumbing.PipingSystem.BaseEquipmentConnector
The connector within base equipment which is used to connect with system.
Remarks: Setting this property to null will disconnect base equipment from system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when assigning a connector which is used in a system,
or when the connector's owner is not of type 'mechanical equipment'.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the set operation failed.

Autodesk.Revit.DB.Plumbing.PipingSystem.SystemType
The type of this piping system.

Autodesk.Revit.DB.Plumbing.PipingSystem
A piping system element.
Since:
2011